DataProcessors/ОтправитьСообщенияОЗадержкеПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправитьСообщенияОЗадержкеПоставки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыКОбработке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДокумента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РассылкаДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РассылкаДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРассылокЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРассылокЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРассылокЭлектроннойПочты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛистНаФТП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведениеКорректировкиСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОЗадержкеПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроблемыС_УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведениеКорректировкиЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОтправитьСообщенияОЗадержкеПоставки/Ext/ObjectModule.bsl
Функция ЗаполнитьТаблицуКлиентовПоКонтрагентам() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ОбъектДокумента КАК Контрагент
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЗнач.Контрагент КАК Грузополучатель
	|ПОМЕСТИТЬ Грузополучатели
	|ИЗ
	|	ТЗ КАК ТабЗнач
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т1
	|			ПО Т1.Контрагент = ТабЗнач.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПроизвольноеСообщение)) КАК Т2
	|			ПО Т2.Контрагент = ТабЗнач.Контрагент	
	|ГДЕ
	|	Т1.Контрагент ЕСТЬ NULL
	|	ИЛИ Т2.Контрагент ЕСТЬ NULL	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Грузополучатели.Грузополучатель КАК Клиент,
	|	1 КАК Отправить,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Адрес
	|ИЗ
	|	Грузополучатели КАК Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО (Контрагенты.Ссылка = (ВЫРАЗИТЬ(КонтактнаяИнформация.Объект.Ссылка КАК Справочник.Контрагенты)))
	|		ПО Грузополучатели.Грузополучатель = Контрагенты.Ссылка
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200))) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТЗ", ДокументыКОбработке.Выгрузить(, "ОбъектДокумента"));
	Результат = Запрос.ВыполнитьПакет();
	
	
	ТаблицаКлиент = Неопределено; 
	ТаблицаКлиент = Результат[2].Выгрузить();		
		
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ТаблицаКлиент", ТаблицаКлиент);

	Возврат СтруктураВозврат;
	
КонецФункции	

Функция ЗаполнитьТаблицуКлиентовПоЗаданиямНаДоставку() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ОбъектДокумента КАК ЗаданиеНаДоставку
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ЗаданиеНаДоставку,
	|	ЕСТЬNULL(Т1.Контрагент, """") КАК Контрагент
	|ПОМЕСТИТЬ ТЗЗаданиеНаДоставку
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку.Доставка КАК Т1
	|		ПО ТЗ.ЗаданиеНаДоставку = Т1.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗЗаданиеНаДоставку.Контрагент КАК Грузополучатель
	|ПОМЕСТИТЬ Грузополучатели
	|ИЗ
	|	ТЗЗаданиеНаДоставку КАК ТЗЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т1
	|		ПО ((ВЫРАЗИТЬ(Т1.Документ КАК Документ.ЗаданиеНаДоставку)) = ТЗЗаданиеНаДоставку.ЗаданиеНаДоставку)
	|			И ТЗЗаданиеНаДоставку.Контрагент = Т1.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПроизвольноеСообщение)) КАК Т2
	|		ПО ((ВЫРАЗИТЬ(Т2.Документ КАК Документ.ЗаданиеНаДоставку)) = ТЗЗаданиеНаДоставку.ЗаданиеНаДоставку)
	|			И ТЗЗаданиеНаДоставку.Контрагент = Т2.Контрагент
	|ГДЕ
	|	(Т1.Контрагент ЕСТЬ NULL
	|			ИЛИ Т2.Контрагент ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Грузополучатели.Грузополучатель КАК Клиент,
	|	1 КАК Отправить,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Адрес
	|ИЗ
	|	Грузополучатели КАК Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО (Контрагенты.Ссылка = (ВЫРАЗИТЬ(КонтактнаяИнформация.Объект.Ссылка КАК Справочник.Контрагенты)))
	|		ПО Грузополучатели.Грузополучатель = Контрагенты.Ссылка
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200))) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТЗ", ДокументыКОбработке.Выгрузить(, "ОбъектДокумента"));
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаКлиент = Результат[3].Выгрузить();		
		
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ТаблицаКлиент", ТаблицаКлиент);

	Возврат СтруктураВозврат;
	
КонецФункции	

Функция ЗаполнитьТаблицуКлиентовПоЗаказамПоставщику() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ОбъектДокумента КАК ЗаказПоставщику
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Заказ КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
	|	ТЗ.ЗаказПоставщику,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.КодПроизводителя,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель,
	|	ЗаказПоставщикуТовары.Количество
	|ПОМЕСТИТЬ ТЗЗаказыПокупателя
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО ТЗ.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель
	|ПОМЕСТИТЬ Грузополучатели
	|ИЗ
	|	ТЗЗаказыПокупателя КАК ТЗЗаказыПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т1
	|		ПО ((ВЫРАЗИТЬ(Т1.Документ КАК Документ.ЗаказПоставщику)) = ТЗЗаказыПокупателя.ЗаказПоставщику)
	|			И ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель = Т1.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т2
	|		ПО ((ВЫРАЗИТЬ(Т2.Документ КАК Документ.ЗаказПоставщику)) = ТЗЗаказыПокупателя.ЗаказПоставщику)
	|			И ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель = Т2.Контрагент
	|ГДЕ
	|	(Т1.Контрагент ЕСТЬ NULL
	|			ИЛИ Т2.Контрагент ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Грузополучатели.ЗаказПокупателяГрузополучатель КАК Клиент,
	|	1 КАК Отправить,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Адрес
	|ИЗ
	|	Грузополучатели КАК Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО (Контрагенты.Ссылка = (ВЫРАЗИТЬ(КонтактнаяИнформация.Объект.Ссылка КАК Справочник.Контрагенты)))
	|		ПО Грузополучатели.ЗаказПокупателяГрузополучатель = Контрагенты.Ссылка
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200))) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель КАК ЗаказПокупателяГрузополучатель,
	|	ТЗЗаказыПокупателя.Номенклатура,
	|	ТЗЗаказыПокупателя.НоменклатураКодПроизводителя,
	|	ТЗЗаказыПокупателя.НоменклатураРодитель,
	|	СУММА(ТЗЗаказыПокупателя.Количество) КАК Количество
	|ИЗ
	|	ТЗЗаказыПокупателя КАК ТЗЗаказыПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель,
	|	ТЗЗаказыПокупателя.НоменклатураКодПроизводителя,
	|	ТЗЗаказыПокупателя.Номенклатура,
	|	ТЗЗаказыПокупателя.НоменклатураРодитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателяГрузополучатель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());	
	Запрос.УстановитьПараметр("ТЗ", ДокументыКОбработке.Выгрузить(, "ОбъектДокумента"));
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаКлиент = Результат[3].Выгрузить();
	ТаблицаТоварыПоКлиентам = Результат[4].Выгрузить();
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ТаблицаКлиент", ТаблицаКлиент);
	СтруктураВозврат.Вставить("ТаблицаТоварыПоКлиентам", ТаблицаТоварыПоКлиентам);

	Возврат СтруктураВозврат;
	
КонецФункции
